# Pandas

# Series

In [1]:
import pandas as pd

In [2]:
obj1 = pd.Series([11,22,33,44])

In [3]:
obj1

0    11
1    22
2    33
3    44
dtype: int64

In [4]:
obj1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj1.values

array([11, 22, 33, 44], dtype=int64)

In [6]:
obj1.value_counts

<bound method IndexOpsMixin.value_counts of 0    11
1    22
2    33
3    44
dtype: int64>

# Reindexing

In [7]:
obj2 = pd.Series([11,22,33,44], index = ['a', 'b', 'c', 'd']) # here we define index manually

In [8]:
obj2

a    11
b    22
c    33
d    44
dtype: int64

In [9]:
obj2['c']

33

In [10]:
obj2['c'] = 34

In [11]:
obj2

a    11
b    22
c    34
d    44
dtype: int64

In [12]:
del obj2['c']

In [13]:
obj2

a    11
b    22
d    44
dtype: int64

In [14]:
obj2['c'] = 34

In [15]:
obj2

a    11
b    22
d    44
c    34
dtype: int64

In [16]:
index = [1,2,3,4]

In [17]:
obj3 = pd.Series(['Saad', 'Amim', 'Ali', 'Moiz'], index = index)

In [18]:
obj3

1    Saad
2    Amim
3     Ali
4    Moiz
dtype: object

In [19]:
obj3[3]

'Ali'

In [20]:
obj3 == 'Saad'

1     True
2    False
3    False
4    False
dtype: bool

In [21]:
obj3 == 'Khalil'

1    False
2    False
3    False
4    False
dtype: bool

In [22]:
obj3[obj3 == 'Saad']

1    Saad
dtype: object

In [23]:
obj3[obj3 == 'Khalil']

Series([], dtype: object)

# Arithmetic And Data Alignment

In [24]:
obj1

0    11
1    22
2    33
3    44
dtype: int64

In [25]:
obj1+1

0    12
1    23
2    34
3    45
dtype: int64

In [26]:
obj3

1    Saad
2    Amim
3     Ali
4    Moiz
dtype: object

In [27]:
obj3*2

1    SaadSaad
2    AmimAmim
3      AliAli
4    MoizMoiz
dtype: object

In [28]:
obj1*2

0    22
1    44
2    66
3    88
dtype: int64

In [29]:
obj1-2

0     9
1    20
2    31
3    42
dtype: int64

In [30]:
obj1//2

0     5
1    11
2    16
3    22
dtype: int64

In [31]:
obj1

0    11
1    22
2    33
3    44
dtype: int64

In [32]:
obj2

a    11
b    22
d    44
c    34
dtype: int64

In [33]:
obj1+obj2

0   NaN
1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [34]:
obj4 = pd.Series([11,33,22,44], index = [0,1,2,3])

In [35]:
obj4

0    11
1    33
2    22
3    44
dtype: int64

In [36]:
obj1+obj4

0    22
1    55
2    55
3    88
dtype: int64

In [37]:
obj1-obj4

0     0
1   -11
2    11
3     0
dtype: int64

In [38]:
obj1*obj4

0     121
1     726
2     726
3    1936
dtype: int64

In [39]:
obj4//obj1

0    1
1    1
2    0
3    1
dtype: int64

In [40]:
obj5 = pd.Series([100,200,300,400,500], index = ['1h', '2h', '3h', '4h', '5h'])

In [41]:
obj5

1h    100
2h    200
3h    300
4h    400
5h    500
dtype: int64

In [42]:
'1h' in obj5

True

In [43]:
'6h' in obj5

False

Creating a series using python dictionary

In [44]:
sdata = {'Karachi':"Mazar-e-Quaid", 'Lahore':"Minar-e-Pakistan", 'Peshawar':"Bab-e-Khaybar", 'Multan':"Halwa"}
#         index   :     value        index  :      value           index   :     value        index  : value

In [45]:
s1 = pd.Series(sdata)

In [46]:
s1

Karachi        Mazar-e-Quaid
Lahore      Minar-e-Pakistan
Peshawar       Bab-e-Khaybar
Multan                 Halwa
dtype: object

In [47]:
city = ['Karachi', 'Multan', 'Lahore', 'Islamabad']

In [48]:
s2 = pd.Series(sdata, index = city)

In [49]:
s2

Karachi         Mazar-e-Quaid
Multan                  Halwa
Lahore       Minar-e-Pakistan
Islamabad                 NaN
dtype: object

In [50]:
pd.isnull(s2)

Karachi      False
Multan       False
Lahore       False
Islamabad     True
dtype: bool

In [51]:
s2[pd.isnull(s2)]

Islamabad    NaN
dtype: object

In [52]:
pd.notnull(s2)

Karachi       True
Multan        True
Lahore        True
Islamabad    False
dtype: bool

In [53]:
s2[pd.notnull(s2)]

Karachi       Mazar-e-Quaid
Multan                Halwa
Lahore     Minar-e-Pakistan
dtype: object

In [54]:
obj6 = pd.Series(['Blue', 'Green', 'White'], index = [0,2,4])

In [55]:
obj6

0     Blue
2    Green
4    White
dtype: object

In [56]:
obj6.reindex(range(6), method = 'ffill')

0     Blue
1     Blue
2    Green
3    Green
4    White
5    White
dtype: object

In [57]:
obj6.reindex(range(8), method = 'ffill')

0     Blue
1     Blue
2    Green
3    Green
4    White
5    White
6    White
7    White
dtype: object

# Data Frame

In [58]:
data = {'City':['Karachi', 'Lahore', 'Islamabad', 'Multan'],
         'Population':[4.0, 1.5, 1.0, 0.8],
         'Year':[2019, 2019, 2019, 2019]}

In [59]:
frame = pd.DataFrame(data)

In [60]:
frame

        City  Population  Year
0    Karachi         4.0  2019
1     Lahore         1.5  2019
2  Islamabad         1.0  2019
3     Multan         0.8  2019

In [61]:
frame2 = pd.DataFrame(data, columns = ['Year', 'City', 'Population'])

In [62]:
frame2

   Year       City  Population
0  2019    Karachi         4.0
1  2019     Lahore         1.5
2  2019  Islamabad         1.0
3  2019     Multan         0.8

In [63]:
frame.describe()

       Population    Year
count    4.000000     4.0
mean     1.825000  2019.0
std      1.479583     0.0
min      0.800000  2019.0
25%      0.950000  2019.0
50%      1.250000  2019.0
75%      2.125000  2019.0
max      4.000000  2019.0

In [64]:
frame2.describe()

         Year  Population
count     4.0    4.000000
mean   2019.0    1.825000
std       0.0    1.479583
min    2019.0    0.800000
25%    2019.0    0.950000
50%    2019.0    1.250000
75%    2019.0    2.125000
max    2019.0    4.000000

In [65]:
frame2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Year          4 non-null int64
City          4 non-null object
Population    4 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 176.0+ bytes

In [66]:
frame3 = pd.DataFrame(data, columns = ['City', 'Population', 'Year', 'Location'], index = ['i', 'ii', 'iii', 'iv'])

In [67]:
frame3

          City  Population  Year Location
i      Karachi         4.0  2019      NaN
ii      Lahore         1.5  2019      NaN
iii  Islamabad         1.0  2019      NaN
iv      Multan         0.8  2019      NaN

In [68]:
frame3['Location'] = 'Pakistan'

In [69]:
frame3

          City  Population  Year  Location
i      Karachi         4.0  2019  Pakistan
ii      Lahore         1.5  2019  Pakistan
iii  Islamabad         1.0  2019  Pakistan
iv      Multan         0.8  2019  Pakistan

In [70]:
frame3 = pd.DataFrame(data, columns = ['Serial', 'City', 'Population', 'Year', 'Location'],
                      index = ['i', 'ii', 'iii', 'iv'])

In [71]:
frame3

    Serial       City  Population  Year Location
i      NaN    Karachi         4.0  2019      NaN
ii     NaN     Lahore         1.5  2019      NaN
iii    NaN  Islamabad         1.0  2019      NaN
iv     NaN     Multan         0.8  2019      NaN

In [72]:
frame3['Location'] = 'Pakistan'

In [73]:
frame3

    Serial       City  Population  Year  Location
i      NaN    Karachi         4.0  2019  Pakistan
ii     NaN     Lahore         1.5  2019  Pakistan
iii    NaN  Islamabad         1.0  2019  Pakistan
iv     NaN     Multan         0.8  2019  Pakistan

In [74]:
frame3['Serial'] = 1

In [75]:
frame3

     Serial       City  Population  Year  Location
i         1    Karachi         4.0  2019  Pakistan
ii        1     Lahore         1.5  2019  Pakistan
iii       1  Islamabad         1.0  2019  Pakistan
iv        1     Multan         0.8  2019  Pakistan

In [76]:
frame3['Serial'] = [1,2,3,4]

In [77]:
frame3

     Serial       City  Population  Year  Location
i         1    Karachi         4.0  2019  Pakistan
ii        2     Lahore         1.5  2019  Pakistan
iii       3  Islamabad         1.0  2019  Pakistan
iv        4     Multan         0.8  2019  Pakistan

In [78]:
frame3['Serial'] = range(1,5)

In [79]:
frame3

     Serial       City  Population  Year  Location
i         1    Karachi         4.0  2019  Pakistan
ii        2     Lahore         1.5  2019  Pakistan
iii       3  Islamabad         1.0  2019  Pakistan
iv        4     Multan         0.8  2019  Pakistan

In [80]:
frame3.columns

Index(['Serial', 'City', 'Population', 'Year', 'Location'], dtype='object')

In [81]:
frame3.Serial

i      1
ii     2
iii    3
iv     4
Name: Serial, dtype: int32

In [82]:
frame3.City

i        Karachi
ii        Lahore
iii    Islamabad
iv        Multan
Name: City, dtype: object

In [83]:
frame3['City']

i        Karachi
ii        Lahore
iii    Islamabad
iv        Multan
Name: City, dtype: object

In [84]:
frame3[['City']]

          City
i      Karachi
ii      Lahore
iii  Islamabad
iv      Multan

In [85]:
frame3[['City', 'Population']]

          City  Population
i      Karachi         4.0
ii      Lahore         1.5
iii  Islamabad         1.0
iv      Multan         0.8

In [86]:
frame3

     Serial       City  Population  Year  Location
i         1    Karachi         4.0  2019  Pakistan
ii        2     Lahore         1.5  2019  Pakistan
iii       3  Islamabad         1.0  2019  Pakistan
iv        4     Multan         0.8  2019  Pakistan

In [87]:
frame3.loc['i']

Serial               1
City           Karachi
Population           4
Year              2019
Location      Pakistan
Name: i, dtype: object

In [88]:
frame3.iloc[1]

Serial               2
City            Lahore
Population         1.5
Year              2019
Location      Pakistan
Name: ii, dtype: object

In [94]:
data2 = pd.read_csv('banknotes.csv')

In [95]:
data2

            V1        V2         V3        V4  Class
0     3.621600   8.66610  -2.807300 -0.446990      1
1     4.545900   8.16740  -2.458600 -1.462100      1
2     3.866000  -2.63830   1.924200  0.106450      1
3     3.456600   9.52280  -4.011200 -3.594400      1
4     0.329240  -4.45520   4.571800 -0.988800      1
5     4.368400   9.67180  -3.960600 -3.162500      1
6     3.591200   3.01290   0.728880  0.564210      1
7     2.092200  -6.81000   8.463600 -0.602160      1
8     3.203200   5.75880  -0.753450 -0.612510      1
9     1.535600   9.17720  -2.271800 -0.735350      1
10    1.224700   8.77790  -2.213500 -0.806470      1
11    3.989900  -2.70660   2.394600  0.862910      1
12    1.899300   7.66250   0.153940 -3.110800      1
13   -1.576800  10.84300   2.546200 -2.936200      1
14    3.404000   8.72610  -2.991500 -0.572420      1
15    4.676500  -3.38950   3.489600  1.477100      1
16    2.671900   3.06460   0.371580  0.586190      1
17    0.803550   2.84730   4.343900  0.601700      1
18    1.447900  -4.87940   8.342800 -2.108600      1
19    5.242300  11.02720  -4.353000 -4.101300      1
20    5.786700   7.89020  -2.619600 -0.487080      1
21    0.329200  -4.45520   4.571800 -0.988800      1
22    3.936200  10.16220  -3.823500 -4.017200      1
23    0.935840   8.88550  -1.683100 -1.659900      1
24    4.433800   9.88700  -4.679500 -3.748300      1
25    0.705700  -5.49810   8.336800 -2.871500      1
26    1.143200  -3.74130   5.577700 -0.635780      1
27   -0.382140   8.39090   2.162400 -3.740500      1
28    6.563300   9.81870  -4.411300 -3.225800      1
29    4.890600  -3.35840   3.420200  1.090500      1
...        ...       ...        ...       ...    ...
1342 -1.747900  -5.82300   5.869900  1.212000      2
1343 -0.959230  -6.71280   4.985700  0.328860      2
1344  1.345100   0.23589  -1.878500  1.325800      2
1345  2.227900   4.09510  -4.803700 -2.111200      2
1346  1.257200   4.87310  -5.286100 -5.874100      2
1347 -5.385700   9.12140  -0.419290 -5.918100      2
1348 -2.978600   2.34450   0.526670 -0.401730      2
1349 -1.585100  -2.15620   1.708200  0.901700      2
1350 -0.218880  -2.20380  -0.095400  0.564210      2
1351  1.318300   1.90170  -3.311100  0.065071      2
1352  1.489600   3.42880  -4.030900 -1.425900      2
1353  0.115920   3.22190  -3.430200 -2.845700      2
1354 -3.392400   3.35640  -0.720040 -3.523300      2
1355 -6.163200   8.70960  -0.216210 -3.634500      2
1356 -4.078600   2.92390   0.870260 -0.653890      2
1357 -2.589900  -0.39110   0.934520  0.429720      2
1358 -1.011600  -0.19038  -0.905970  0.003003      2
1359  0.066129   2.49140  -2.940100 -0.621560      2
1360 -0.247450   1.93680  -2.469700 -0.805180      2
1361 -1.573200   1.06360  -0.712320 -0.838800      2
1362 -2.166800   1.59330   0.045122 -1.678000      2
1363 -1.166700  -1.42370   2.924100  0.661190      2
1364 -2.839100  -6.63000  10.484900 -0.421130      2
1365 -4.504600  -5.81260  10.886700 -0.528460      2
1366 -2.410000   3.74330  -0.402150 -1.295300      2
1367  0.406140   1.34920  -1.450100 -0.559490      2
1368 -1.388700  -4.87730   6.477400  0.341790      2
1369 -3.750300 -13.45860  17.593200 -2.777100      2
1370 -3.563700  -8.38270  12.393000 -1.282300      2
1371 -2.541900  -0.65804   2.684200  1.195200      2

[1372 rows x 5 columns]

In [96]:
data2.head()

        V1      V2      V3       V4  Class
0  3.62160  8.6661 -2.8073 -0.44699      1
1  4.54590  8.1674 -2.4586 -1.46210      1
2  3.86600 -2.6383  1.9242  0.10645      1
3  3.45660  9.5228 -4.0112 -3.59440      1
4  0.32924 -4.4552  4.5718 -0.98880      1

In [97]:
data2.tail()

           V1        V2       V3       V4  Class
1367  0.40614   1.34920  -1.4501 -0.55949      2
1368 -1.38870  -4.87730   6.4774  0.34179      2
1369 -3.75030 -13.45860  17.5932 -2.77710      2
1370 -3.56370  -8.38270  12.3930 -1.28230      2
1371 -2.54190  -0.65804   2.6842  1.19520      2

In [98]:
data2.head(10)

        V1      V2       V3       V4  Class
0  3.62160  8.6661 -2.80730 -0.44699      1
1  4.54590  8.1674 -2.45860 -1.46210      1
2  3.86600 -2.6383  1.92420  0.10645      1
3  3.45660  9.5228 -4.01120 -3.59440      1
4  0.32924 -4.4552  4.57180 -0.98880      1
5  4.36840  9.6718 -3.96060 -3.16250      1
6  3.59120  3.0129  0.72888  0.56421      1
7  2.09220 -6.8100  8.46360 -0.60216      1
8  3.20320  5.7588 -0.75345 -0.61251      1
9  1.53560  9.1772 -2.27180 -0.73535      1

In [99]:
data2.describe()

                V1           V2           V3           V4        Class
count  1372.000000  1372.000000  1372.000000  1372.000000  1372.000000
mean      0.433735     1.922353     1.397627    -1.191657     1.444606
std       2.842763     5.869047     4.310030     2.101013     0.497103
min      -7.042100   -13.773100    -5.286100    -8.548200     1.000000
25%      -1.773000    -1.708200    -1.574975    -2.413450     1.000000
50%       0.496180     2.319650     0.616630    -0.586650     1.000000
75%       2.821475     6.814625     3.179250     0.394810     2.000000
max       6.824800    12.951600    17.927400     2.449500     2.000000

In [100]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1372 entries, 0 to 1371
Data columns (total 5 columns):
V1       1372 non-null float64
V2       1372 non-null float64
V3       1372 non-null float64
V4       1372 non-null float64
Class    1372 non-null int64
dtypes: float64(4), int64(1)
memory usage: 53.7 KB

In [101]:
import numpy as np

In [102]:
frame4 = pd.DataFrame(np.arange(9).reshape(3,3), index = [1, 2, 3], columns = ['Karachi', 'Lahore', 'Multan'])

In [103]:
frame4

   Karachi  Lahore  Multan
1        0       1       2
2        3       4       5
3        6       7       8

In [104]:
frame5 = frame4.reindex([0, 1, 2, 3, 4,])

In [105]:
frame5

   Karachi  Lahore  Multan
0      NaN     NaN     NaN
1      0.0     1.0     2.0
2      3.0     4.0     5.0
3      6.0     7.0     8.0
4      NaN     NaN     NaN

In [106]:
cities = ('Haydarbad', 'Islamabad', 'Karachi')

In [107]:
frame5.reindex(columns = cities)

   Haydarbad  Islamabad  Karachi
0        NaN        NaN      NaN
1        NaN        NaN      0.0
2        NaN        NaN      3.0
3        NaN        NaN      6.0
4        NaN        NaN      NaN

In [108]:
val = pd.Series([-1.2, -3.3, -2.2], index = ['i', 'iii', 'iv'])

In [109]:
val

i     -1.2
iii   -3.3
iv    -2.2
dtype: float64

In [110]:
frame3

     Serial       City  Population  Year  Location
i         1    Karachi         4.0  2019  Pakistan
ii        2     Lahore         1.5  2019  Pakistan
iii       3  Islamabad         1.0  2019  Pakistan
iv        4     Multan         0.8  2019  Pakistan

In [111]:
frame3.Serial = val

In [112]:
frame3

     Serial       City  Population  Year  Location
i      -1.2    Karachi         4.0  2019  Pakistan
ii      NaN     Lahore         1.5  2019  Pakistan
iii    -3.3  Islamabad         1.0  2019  Pakistan
iv     -2.2     Multan         0.8  2019  Pakistan

In [115]:
frame3.Serial['i', 'ii', 'iv'] = [1,2,3]

C:\Users\HP\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [116]:
frame3

     Serial       City  Population  Year  Location
i       1.0    Karachi         4.0  2019  Pakistan
ii      2.0     Lahore         1.5  2019  Pakistan
iii    -3.3  Islamabad         1.0  2019  Pakistan
iv      3.0     Multan         0.8  2019  Pakistan

In [117]:
frame3['Eastern'] = frame3.City == 'Karachi'

In [118]:
frame3

     Serial       City  Population  Year  Location  Eastern
i       1.0    Karachi         4.0  2019  Pakistan     True
ii      2.0     Lahore         1.5  2019  Pakistan    False
iii    -3.3  Islamabad         1.0  2019  Pakistan    False
iv      3.0     Multan         0.8  2019  Pakistan    False

In [119]:
data3 = {'Name':['Saad', 'Ali', 'Amim', 'Mushtaq', 'Umair'],
         'Marks_In_AI':[99,18,77,66,55],
         'Marks_In_Python':[98,47,76,65,54],
         'Marks_In_Numpy':[97,56,75,64,13]}

In [120]:
score = pd.DataFrame(data3)

In [121]:
score

      Name  Marks_In_AI  Marks_In_Python  Marks_In_Numpy
0     Saad           99               98              97
1      Ali           18               47              56
2     Amim           77               76              75
3  Mushtaq           66               65              64
4    Umair           55               54              13

In [122]:
score['Total_Marks'] = 300

In [123]:
score

      Name  Marks_In_AI  Marks_In_Python  Marks_In_Numpy  Total_Marks
0     Saad           99               98              97          300
1      Ali           18               47              56          300
2     Amim           77               76              75          300
3  Mushtaq           66               65              64          300
4    Umair           55               54              13          300

In [124]:
score['Obtained_Marks'] = score['Marks_In_AI']+score['Marks_In_Python']+score['Marks_In_Numpy']

In [125]:
score

,Name,Marks_In_AI,Marks_In_Python,Marks_In_Numpy,Total_Marks,Obtained_Marks
0,Saad,99,98,97,300,294
1,Ali,18,47,56,300,121
2,Amim,77,76,75,300,228
3,Mushtaq,66,65,64,300,195
4,Umair,55,54,13,300,122

In [126]:
score['Percentage'] = score['Obtained_Marks']/score['Total_Marks']*100

In [127]:
score

,Name,Marks_In_AI,Marks_In_Python,Marks_In_Numpy,Total_Marks,Obtained_Marks,Percentage
0,Saad,99,98,97,300,294,98.000000
1,Ali,18,47,56,300,121,40.333333
2,Amim,77,76,75,300,228,76.000000
3,Mushtaq,66,65,64,300,195,65.000000
4,Umair,55,54,13,300,122,40.666667

In [128]:
score['Status'] = ['Passed' if percent>=50 else 'Failed' for percent in score['Percentage']]

In [129]:
score

,Name,Marks_In_AI,Marks_In_Python,Marks_In_Numpy,Total_Marks,Obtained_Marks,Percentage,Status
0,Saad,99,98,97,300,294,98.000000,Passed
1,Ali,18,47,56,300,121,40.333333,Failed
2,Amim,77,76,75,300,228,76.000000,Passed
3,Mushtaq,66,65,64,300,195,65.000000,Passed
4,Umair,55,54,13,300,122,40.666667,Failed

In [130]:
score['Final_Status'] = ['Passed' if ai>=50 and py>=50 and np>=50 else 'Failed' 
                         for ai,py,np in zip(score.Marks_In_AI, score.Marks_In_Numpy, score.Marks_In_Python)]

In [131]:
score

,Name,Marks_In_AI,Marks_In_Python,Marks_In_Numpy,Total_Marks,Obtained_Marks,Percentage,Status,Final_Status
0,Saad,99,98,97,300,294,98.000000,Passed,Passed
1,Ali,18,47,56,300,121,40.333333,Failed,Failed
2,Amim,77,76,75,300,228,76.000000,Passed,Passed
3,Mushtaq,66,65,64,300,195,65.000000,Passed,Passed
4,Umair,55,54,13,300,122,40.666667,Failed,Failed

In [132]:
pop = {'Karachi':{2000:1.5, 2010:3.0, 2019:4.0},
       'Lahore':{2000:0.5, 2011:1.0, 2019:1.5}}

In [133]:
frame6 = pd.DataFrame(pop)

In [134]:
frame6

      Karachi  Lahore
2000      1.5     0.5
2010      3.0     NaN
2011      NaN     1.0
2019      4.0     1.5

In [135]:
frame6.T

         2000  2010  2011  2019
Karachi   1.5   3.0   NaN   4.0
Lahore    0.5   NaN   1.0   1.5

In [136]:
pd.DataFrame(pop, index = [2000, 2002, 2019])

      Karachi  Lahore
2000      1.5     0.5
2002      NaN     NaN
2019      4.0     1.5

# Index Objects

In [137]:
obj7= pd.Series(range(3), index = ['a', 'b', 'c'])

In [138]:
obj7

a    0
b    1
c    2
dtype: int64

In [139]:
index = obj7.index

In [140]:
index

Index(['a', 'b', 'c'], dtype='object')

In [141]:
index2 = obj7.values

In [142]:
index2

array([0, 1, 2], dtype=int64)

In [143]:
index[1:]

Index(['b', 'c'], dtype='object')

In [144]:
index[:2]

Index(['a', 'b'], dtype='object')

In [145]:
index[1]

'b'

In [146]:
labels = pd.Index(np.arange(3))

In [147]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [148]:
obj8 = pd.Series([1.2, 2.2, 3.3], index = labels)

In [149]:
obj8

0    1.2
1    2.2
2    3.3
dtype: float64

In [150]:
obj8.index is labels

True

In [151]:
obj8.index is obj5

False

# Dropping Entries From An Axis

In [152]:
obj9 = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

In [153]:
obj9

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [154]:
new_obj = obj9.drop('c')

In [155]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [156]:
new_obj2 = obj9.drop(['a', 'c'])

In [157]:
new_obj2

b    1.0
d    3.0
e    4.0
dtype: float64

In [158]:
data4 = pd.DataFrame(np.arange(16).reshape(4,4),
                     index = ['Karachi', 'Lahore', 'Multan', 'Peshawar'],
                     columns = [1,2,3,4])

In [159]:
data4

           1   2   3   4
Karachi    0   1   2   3
Lahore     4   5   6   7
Multan     8   9  10  11
Peshawar  12  13  14  15

In [160]:
data4.drop(['Lahore', 'Multan'])

           1   2   3   4
Karachi    0   1   2   3
Peshawar  12  13  14  15

In [161]:
data4.drop(2, axis = 1)

           1   3   4
Karachi    0   2   3
Lahore     4   6   7
Multan     8  10  11
Peshawar  12  14  15

OR

In [162]:
data4.drop([2, 3], axis = 'columns')

           1   4
Karachi    0   3
Lahore     4   7
Multan     8  11
Peshawar  12  15

In [163]:
data4

           1   2   3   4
Karachi    0   1   2   3
Lahore     4   5   6   7
Multan     8   9  10  11
Peshawar  12  13  14  15

In [164]:
data4.drop('Peshawar', inplace = True)

In [165]:
data4

         1  2   3   4
Karachi  0  1   2   3
Lahore   4  5   6   7
Multan   8  9  10  11

# Function Application And Mapping

In [166]:
frame7 = pd.DataFrame(np.random.randn(4, 3), columns = list('bde'), index = ['Karachi', 'Lahore', 'Islamabad', 'Quetta'])

In [167]:
frame7

                  b         d         e
Karachi    1.523014  1.574411  0.129212
Lahore     0.476343 -1.572065  0.878976
Islamabad  1.169361 -0.710956 -0.520088
Quetta    -0.313400  0.640503 -0.502791

In [168]:
frame7 = np.abs(frame7)  #'abs' function remoe -ve sign

In [169]:
frame7

                  b         d         e
Karachi    1.523014  1.574411  0.129212
Lahore     0.476343  1.572065  0.878976
Islamabad  1.169361  0.710956  0.520088
Quetta     0.313400  0.640503  0.502791

In [170]:
f = lambda x: x.max() - x.min()  #  by default perform operation raw wise mean column
frame7.apply(f)

b    1.209614
d    0.933908
e    0.749764
dtype: float64

In [171]:
frame7.apply(f, axis = 'columns')  #  here we change the axis fromm raw to columns means raw

Karachi      1.445199
Lahore       1.095722
Islamabad    0.649273
Quetta       0.327103
dtype: float64

# Soring And Ranking

In [172]:
obj10 = pd.Series([1,0,3,2], index = ['d', 'a', 'b', 'c'])

In [173]:
obj10

d    1
a    0
b    3
c    2
dtype: int64

In [174]:
obj10.sort_index()

a    0
b    3
c    2
d    1
dtype: int64

In [175]:
obj10.sort_values()

a    0
d    1
c    2
b    3
dtype: int64

In [176]:
frame8 = pd.DataFrame(np.arange(8).reshape(2,4), index = ['three', 'one'], columns = ['d', 'a', 'b', 'c'])

In [177]:
frame8

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [178]:
frame8.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [179]:
frame8.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [180]:
obj11 = pd.Series([4, 7, -3, 2])

In [181]:
obj11

0    4
1    7
2   -3
3    2
dtype: int64

In [182]:
obj11.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [183]:
obj11.sort_index()

0    4
1    7
2   -3
3    2
dtype: int64

In [184]:
frame9 = pd.DataFrame({'b':[4, 7, -3, 2], 'a':[0, 1, 0, 1]})

In [185]:
frame9

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [186]:
frame9.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [187]:
frame9.sort_values(by = 'a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [188]:
frame9

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [189]:
frame9.sort_values(by = ['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [190]:
frame9.sort_values(by = ['b', 'a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [191]:
obj12 = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [192]:
obj12

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [193]:
obj12.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [194]:
obj13 = pd.Series([2,2,4,5,7,8])

In [195]:
obj13

0    2
1    2
2    4
3    5
4    7
5    8
dtype: int64

In [196]:
obj13.rank()

0    1.5
1    1.5
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [197]:
obj13.rank(method = 'first')

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [198]:
obj12

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [199]:
obj12.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

# Summarizing And Computing Descriptive Statistics

In [200]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                   index = ['a', 'b', 'c', 'd'],
                   columns = ['one', 'two'])

In [201]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [202]:
df.sum()   # by default operation perform raw wise means column and NaN values will be neglegted

one    9.25
two   -5.80
dtype: float64

In [203]:
df.sum(axis = 'columns')  # operation perform column wise means raw and NaN values will be neglegted

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [204]:
df.sum(skipna = False)

one   NaN
two   NaN
dtype: float64

In [205]:
df.sum(axis = 'columns', skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [206]:
df.mean()    # by default operation perform raw wise means column and NaN values will be neglegted

one    3.083333
two   -2.900000
dtype: float64

In [207]:
df.mean(axis = 'columns')   # operation perform column wise means raw and NaN values will be neglegted

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [208]:
df.mean(skipna = False)

one   NaN
two   NaN
dtype: float64

In [209]:
df.mean(axis = 'columns', skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [210]:
frame10 = pd.DataFrame({'b':[1,0], 'a':[0,1]})

In [211]:
frame10

   b  a
0  1  0
1  0  1

In [212]:
frame10.corr()

     b    a
b  1.0 -1.0
a -1.0  1.0

In [213]:
frame10.cov()

     b    a
b  0.5 -0.5
a -0.5  0.5

In [214]:
import pandas_datareader.data as web

In [216]:
all_data = {ticker: web.get_data_yahoo(ticker)
                       for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [217]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})

In [218]:
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [219]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2015-01-08  112.150002  108.699997  109.230003  111.889999   59364500.0
 2015-01-09  113.250000  110.209999  112.669998  112.010002   53699500.0
 2015-01-12  112.629997  108.800003  112.599998  109.250000   49650800.0
 2015-01-13  112.800003  108.910004  111.430000  110.220001   67091900.0
 2015-01-14  110.489998  108.500000  109.040001  109.800003   48956600.0
 2015-01-15  110.059998  106.660004  110.000000  106.820000   60014000.0
 2015-01-16  107.580002  105.199997  107.029999  105.989998   78513300.0
 2015-01-20  108.970001  106.500000  107.839996  108.720001   49899900.0
 2015-01-21  111.059998  108.269997  108.949997  109.550003   48575900.0
 2015-01-22  112.470001  109.720001  110.260002  112.400002   53796400.0
 2015-01-23  113.750000  111.529999  112.300003  112.980003   46464800.0
 2015-01-26  114.360001  112.800003  113.739998  113.099998   55615000.0
 2015-01-27  112.480003  109.029999  112.419998  109.139999   95568700.0
 2015-01-28  118.120003  115.309998  117.629997  115.309998  146477100.0
 2015-01-29  119.190002  115.559998  116.320000  118.900002   84436400.0
 2015-01-30  120.000000  116.849998  118.400002  117.160004   83745500.0
 2015-02-02  119.169998  116.080002  118.050003  118.629997   62739100.0
 2015-02-03  119.089996  117.610001  118.500000  118.650002   51915700.0
 2015-02-04  120.510002  118.309998  118.500000  119.559998   70149700.0
 2015-02-05  120.230003  119.250000  120.019997  119.940002   42246200.0
 2015-02-06  120.250000  118.449997  120.019997  118.930000   43706600.0
 2015-02-09  119.839996  118.430000  118.550003  119.720001   38889800.0
 2015-02-10  122.150002  120.160004  120.169998  122.019997   62008500.0
 2015-02-11  124.919998  122.500000  122.769997  124.879997   73561800.0
 2015-02-12  127.480003  125.570000  126.059998  126.459999   74474500.0
 2015-02-13  127.279999  125.650002  127.279999  127.080002   54272200.0
 2015-02-17  128.880005  126.919998  127.489998  127.830002   63152400.0
 2015-02-18  128.779999  127.449997  127.629997  128.720001   44891700.0
 2015-02-19  129.029999  128.330002  128.479996  128.449997   37362400.0
 2015-02-20  129.500000  128.050003  128.619995  129.500000   48948400.0
 ...                ...         ...         ...         ...          ...
 2019-11-22  263.179993  260.839996  262.589996  261.779999   16331300.0
 2019-11-25  266.440002  262.519989  262.709991  266.369995   21005100.0
 2019-11-26  267.160004  262.500000  266.940002  264.290009   26301900.0
 2019-11-27  267.980011  265.309998  265.579987  267.839996   16308900.0
 2019-11-29  268.000000  265.899994  266.600006  267.250000   11654400.0
 2019-12-02  268.250000  263.450012  267.269989  264.160004   23621800.0
 2019-12-03  259.529999  256.290009  258.309998  259.450012   28607600.0
 2019-12-04  263.309998  260.679993  261.070007  261.739990   16795400.0
 2019-12-05  265.890015  262.730011  263.790009  265.579987   18606100.0
 2019-12-06  271.000000  267.299988  267.480011  270.709991   26518900.0
 2019-12-09  270.799988  264.910004  270.000000  266.920013   32010600.0
 2019-12-10  270.070007  265.859985  268.600006  268.480011   22605100.0
 2019-12-11  271.100006  268.500000  268.809998  270.769989   19689200.0
 2019-12-12  272.559998  267.320007  267.779999  271.459991   34327600.0
 2019-12-13  275.299988  270.929993  271.459991  275.149994   33396900.0
 2019-12-16  280.790009  276.980011  277.000000  279.859985   32046500.0
 2019-12-17  281.769989  278.799988  279.570007  280.410004   28539600.0
 2019-12-18  281.899994  279.119995  279.799988  279.739990   29007100.0
 2019-12-19  281.179993  278.950012  279.500000  280.019989   24592300.0
 2019-12-20  282.649994  278.559998  282.230011  279.440002   68994500.0
 2019-12-23  284.250000  280.369995  280.529999  284.000000   24643000.0
 2019-12-24  284.890015  282.920013  284.690002  284.269989   12119700.0
 2019-12-26  289.980011  284.700012  284.820007  289.910004   23280300.0
 2019-12-27  293.970001  288.119995  291.119995  289.799988   36566500.0
 2019-12-30  292.690002  285.220001  289.459991  291.519989   36028600.0
 2019-12-31  293.679993  289.519989  289.929993  293.649994   25201400.0
 2020-01-02  300.600006  295.190002  296.239990  300.350006   33870100.0
 2020-01-03  300.579987  296.500000  297.149994  297.429993   36580700.0
 2020-01-06  299.959991  292.750000  293.790009  299.799988   29596800.0
 2020-01-07  300.899994  297.480011  299.839996  298.390015   27218000.0

              Adj Close
 Date
 2015-01-08  102.806480
 2015-01-09  102.916725
 2015-01-12  100.380791
 2015-01-13  101.272049
 2015-01-14  100.886154
 2015-01-15   98.148056
 2015-01-16   97.385445
 2015-01-20   99.893822
 2015-01-21  100.656441
 2015-01-22  103.275063
 2015-01-23  103.807991
 2015-01-26  103.918228
 2015-01-27  100.279716
 2015-01-28  105.948822
 2015-01-29  109.247391
 2015-01-30  107.648643
 2015-02-02  108.999298
 2015-02-03  109.017654
 2015-02-04  109.853806
 2015-02-05  110.637886
 2015-02-06  109.706200
 2015-02-09  110.434944
 2015-02-10  112.556557
 2015-02-11  115.194748
 2015-02-12  116.652199
 2015-02-13  117.224121
 2015-02-17  117.915962
 2015-02-18  118.736946
 2015-02-19  118.487869
 2015-02-20  119.456444
 ...                ...
 2019-11-22  261.779999
 2019-11-25  266.369995
 2019-11-26  264.290009
 2019-11-27  267.839996
 2019-11-29  267.250000
 2019-12-02  264.160004
 2019-12-03  259.450012
 2019-12-04  261.739990
 2019-12-05  265.579987
 2019-12-06  270.709991
 2019-12-09  266.920013
 2019-12-10  268.480011
 2019-12-11  270.769989
 2019-12-12  271.459991
 2019-12-13  275.149994
 2019-12-16  279.859985
 2019-12-17  280.410004
 2019-12-18  279.739990
 2019-12-19  280.019989
 2019-12-20  279.440002
 2019-12-23  284.000000
 2019-12-24  284.269989
 2019-12-26  289.910004
 2019-12-27  289.799988
 2019-12-30  291.519989
 2019-12-31  293.649994
 2020-01-02  300.350006
 2020-01-03  297.429993
 2020-01-06  299.799988
 2020-01-07  298.390015

 [1258 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2015-01-08  159.039993  155.550003  156.240005  158.419998   4236800.0
 2015-01-09  160.339996  157.250000  158.419998  159.110001   4488300.0
 2015-01-12  159.250000  155.759995  159.000000  156.440002   4187600.0
 2015-01-13  159.970001  155.679993  157.259995  156.809998   4377500.0
 2015-01-14  156.490005  153.740005  154.860001  155.800003   4690300.0
 2015-01-15  156.970001  154.160004  156.690002  154.570007   4248400.0
 2015-01-16  157.630005  153.820007  153.820007  157.139999   5756000.0
 2015-01-20  157.330002  154.029999  156.699997  156.949997   8392800.0
 2015-01-21  154.500000  151.070007  153.029999  152.089996  11897100.0
 2015-01-22  155.720001  151.759995  151.940002  155.389999   6120100.0
 2015-01-23  157.600006  154.889999  155.029999  155.869995   4834800.0
 2015-01-26  159.460007  155.770004  158.259995  156.360001   7888100.0
 2015-01-27  155.089996  152.589996  154.940002  153.669998   5659600.0
 2015-01-28  154.529999  151.550003  154.000000  151.550003   4495900.0
 2015-01-29  155.580002  149.520004  151.380005  155.479996   8320800.0
 2015-01-30  155.240005  153.039993  153.910004  153.309998   6563600.0
 2015-02-02  154.660004  151.509995  154.000000  154.660004   4712200.0
 2015-02-03  158.600006  154.750000  154.750000  158.470001   5539400.0
 2015-02-04  158.710007  156.699997  157.210007  156.960007   3678500.0
 2015-02-05  158.589996  157.149994  157.289993  157.910004   5253600.0
 2015-02-06  158.080002  156.229996  157.339996  156.720001   3256500.0
 2015-02-09  157.500000  155.399994  156.000000  155.750000   3057700.0
 2015-02-10  158.559998  155.080002  156.740005  158.559998   4440600.0
 2015-02-11  159.089996  157.169998  157.759995  158.199997   3626700.0
 2015-02-12  159.500000  158.089996  158.720001  158.520004   3333100.0
 2015-02-13  160.800003  158.639999  158.779999  160.399994   3706900.0
 2015-02-17  161.410004  159.729996  159.750000  160.960007   2894500.0
 2015-02-18  162.470001  160.639999  161.860001  162.190002   4358400.0
 2015-02-19  164.490005  161.440002  162.050003  163.889999   3504400.0
 2015-02-20  164.339996  162.089996  163.639999  163.649994   3353000.0
 ...                ...         ...         ...         ...         ...
 2019-11-22  134.649994  133.589996  134.190002  134.339996   3297500.0
 2019-11-25  136.000000  134.350006  134.470001  135.970001   2590100.0
 2019-11-26  136.149994  134.770004  136.149994  135.089996   3793200.0
 2019-11-27  135.710007  133.619995  135.350006  133.770004   3280900.0
 2019-11-29  134.520004  133.029999  133.600006  134.449997   1825300.0
 2019-12-02  134.500000  132.479996  134.449997  132.910004   3067100.0
 2019-12-03  132.440002  130.690002  132.000000  132.119995   3642500.0
 2019-12-04  133.679993  131.960007  132.860001  131.990005   3530000.0
 2019-12-05  133.240005  131.630005  132.990005  131.910004   3595400.0
 2019-12-06  133.889999  132.699997  132.750000  133.220001   3437500.0
 2019-12-09  134.589996  133.259995  133.350006  133.919998   2968500.0
 2019-12-10  134.839996  133.559998  133.919998  133.910004   3480400.0
 2019-12-11  134.509995  133.669998  134.110001  133.759995   3953300.0
 2019-12-12  135.660004  133.660004  133.699997  135.320007   4824100.0
 2019-12-13  135.500000  134.009995  134.750000  134.210007   2535000.0
 2019-12-16  135.449997  133.850006  134.940002  134.130005   3049200.0
 2019-12-17  134.690002  133.460007  134.279999  134.220001   2907200.0
 2019-12-18  135.000000  134.149994  134.550003  134.410004   3101800.0
 2019-12-19  134.729996  134.190002  134.460007  134.559998   3866500.0
 2019-12-20  136.419998  134.949997  135.740005  135.589996   7111800.0
 2019-12-23  136.149994  135.000000  135.779999  135.550003   2803200.0
 2019-12-24  135.619995  134.610001  135.610001  134.979996   1202100.0
 2019-12-26  135.309998  134.649994  134.979996  134.910004   2129700.0
 2019-12-27  135.750000  134.869995  135.000000  135.270004   2752200.0
 2019-12-30  135.300003  132.500000  135.199997  132.809998   4118900.0
 2019-12-31  134.119995  132.399994  132.529999  134.039993   3777500.0
 2020-01-02  135.919998  134.770004  135.000000  135.419998   3148600.0
 2020-01-03  134.860001  133.559998  133.570007  134.339996   2373700.0
 2020-01-06  134.240005  133.199997  133.419998  134.100006   2425500.0
 2020-01-07  134.960007  133.399994  133.690002  134.190002   3090800.0

              Adj Close
 Date
 2015-01-08  127.657913
 2015-01-09  128.213913
 2015-01-12  126.062386
 2015-01-13  126.360535
 2015-01-14  125.546654
 2015-01-15  124.555489
 2015-01-16  126.626427
 2015-01-20  126.473312
 2015-01-21  122.557053
 2015-01-22  125.216255
 2015-01-23  125.603058
 2015-01-26  125.997902
 2015-01-27  123.830261
 2015-01-28  122.121933
 2015-01-29  125.288780
 2015-01-30  123.540154
 2015-02-02  124.628014
 2015-02-03  127.698143
 2015-02-04  126.481407
 2015-02-05  127.246925
 2015-02-06  127.173882
 2015-02-09  126.386787
 2015-02-10  128.667007
 2015-02-11  128.374893
 2015-02-12  128.634552
 2015-02-13  130.160095
 2015-02-17  130.614532
 2015-02-18  131.612671
 2015-02-19  132.992111
 2015-02-20  132.797379
 ...                ...
 2019-11-22  134.339996
 2019-11-25  135.970001
 2019-11-26  135.089996
 2019-11-27  133.770004
 2019-11-29  134.449997
 2019-12-02  132.910004
 2019-12-03  132.119995
 2019-12-04  131.990005
 2019-12-05  131.910004
 2019-12-06  133.220001
 2019-12-09  133.919998
 2019-12-10  133.910004
 2019-12-11  133.759995
 2019-12-12  135.320007
 2019-12-13  134.210007
 2019-12-16  134.130005
 2019-12-17  134.220001
 2019-12-18  134.410004
 2019-12-19  134.559998
 2019-12-20  135.589996
 2019-12-23  135.550003
 2019-12-24  134.979996
 2019-12-26  134.910004
 2019-12-27  135.270004
 2019-12-30  132.809998
 2019-12-31  134.039993
 2020-01-02  135.419998
 2020-01-03  134.339996
 2020-01-06  134.100006
 2020-01-07  134.190002

 [1258 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close       Volume  \
 Date
 2015-01-08   47.750000   46.720001   46.750000   47.590000   29645200.0
 2015-01-09   47.820000   46.900002   47.610001   47.189999   23944200.0
 2015-01-12   47.540001   46.360001   47.419998   46.599998   23651900.0
 2015-01-13   47.910000   46.060001   46.970001   46.360001   35270600.0
 2015-01-14   46.240002   45.619999   45.959999   45.959999   29719600.0
 2015-01-15   46.380001   45.410000   46.220001   45.480000   32750800.0
 2015-01-16   46.279999   45.169998   45.310001   46.240002   35695300.0
 2015-01-20   46.650002   45.570000   46.299999   46.389999   36161900.0
 2015-01-21   46.139999   45.480000   45.939999   45.919998   39081100.0
 2015-01-22   47.139999   46.080002   46.380001   47.130001   35898000.0
 2015-01-23   47.389999   46.799999   47.360001   47.180000   26211600.0
 2015-01-26   47.130001   46.240002   47.000000   47.009998   42525500.0
 2015-01-27   43.200001   42.110001   42.950001   42.660000  169164000.0
 2015-01-28   42.790001   41.160000   42.740002   41.189999   84507100.0
 2015-01-29   42.119999   40.790001   40.930000   42.009998   63585300.0
 2015-01-30   41.580002   40.349998   41.549999   40.400002   78004900.0
 2015-02-02   41.369999   40.230000   40.590000   41.279999   50352500.0
 2015-02-03   41.930000   41.049999   41.630001   41.599998   52082400.0
 2015-02-04   42.209999   41.360001   41.939999   41.840000   41614800.0
 2015-02-05   42.639999   41.860001   42.220001   42.450001   36548200.0
 2015-02-06   42.790001   42.150002   42.680000   42.410000   34616600.0
 2015-02-09   42.740002   42.209999   42.240002   42.360001   31381100.0
 2015-02-10   42.770000   42.180000   42.740002   42.599998   29670700.0
 2015-02-11   42.650002   42.209999   42.650002   42.380001   38262500.0
 2015-02-12   43.090000   42.509998   42.660000   43.090000   33268800.0
 2015-02-13   43.869999   43.150002   43.380001   43.869999   40264900.0
 2015-02-17   44.000000   43.189999   43.970001   43.580002   33695700.0
 2015-02-18   43.700001   43.389999   43.630001   43.529999   27111700.0
 2015-02-19   43.529999   43.049999   43.180000   43.500000   27603400.0
 2015-02-20   43.880001   43.290001   43.509998   43.860001   29721100.0
 ...                ...         ...         ...         ...          ...
 2019-11-22  150.300003  148.820007  150.070007  149.589996   15901800.0
 2019-11-25  151.350006  149.919998  150.000000  151.229996   22420900.0
 2019-11-26  152.419998  151.320007  151.360001  152.029999   24620100.0
 2019-11-27  152.500000  151.520004  152.330002  152.320007   15184400.0
 2019-11-29  152.300003  151.279999  152.100006  151.380005   11977300.0
 2019-12-02  151.830002  148.320007  151.809998  149.550003   27418400.0
 2019-12-03  149.429993  146.649994  147.490005  149.309998   24066000.0
 2019-12-04  150.179993  149.199997  150.139999  149.850006   17574700.0
 2019-12-05  150.320007  149.479996  150.050003  149.929993   17869100.0
 2019-12-06  151.869995  150.270004  150.990005  151.750000   16403500.0
 2019-12-09  152.210007  150.910004  151.070007  151.360001   16687400.0
 2019-12-10  151.889999  150.759995  151.289993  151.130005   16476100.0
 2019-12-11  151.869995  150.330002  151.539993  151.699997   18856600.0
 2019-12-12  153.440002  151.020004  151.649994  153.240005   24612100.0
 2019-12-13  154.889999  152.830002  153.000000  154.529999   23845400.0
 2019-12-16  155.899994  154.820007  155.110001  155.529999   24144200.0
 2019-12-17  155.710007  154.449997  155.449997  154.690002   25425600.0
 2019-12-18  155.479996  154.179993  154.300003  154.369995   24129200.0
 2019-12-19  155.770004  153.750000  154.000000  155.710007   24958900.0
 2019-12-20  158.490005  156.289993  157.350006  157.410004   53477500.0
 2019-12-23  158.119995  157.270004  158.119995  157.410004   17718200.0
 2019-12-24  157.710007  157.119995  157.479996  157.380005    8989200.0
 2019-12-26  158.729996  157.399994  157.559998  158.669998   14520600.0
 2019-12-27  159.550003  158.220001  159.449997  158.960007   18412800.0
 2019-12-30  159.020004  156.729996  158.990005  157.589996   16348400.0
 2019-12-31  157.770004  156.449997  156.770004  157.699997   18369400.0
 2020-01-02  160.729996  158.330002  158.779999  160.619995   22622100.0
 2020-01-03  159.949997  158.059998  158.320007  158.619995   21116200.0
 2020-01-06  159.100006  156.509995  157.080002  159.029999   20813700.0
 2020-01-07  159.669998  157.320007  159.320007  157.580002   21634100.0

              Adj Close
 Date
 2015-01-08   42.724323
 2015-01-09   42.365219
 2015-01-12   41.835537
 2015-01-13   41.620083
 2015-01-14   41.260979
 2015-01-15   40.830055
 2015-01-16   41.512352
 2015-01-20   41.647015
 2015-01-21   41.225071
 2015-01-22   42.311356
 2015-01-23   42.356243
 2015-01-26   42.203625
 2015-01-27   38.298370
 2015-01-28   36.978668
 2015-01-29   37.714828
 2015-01-30   36.269444
 2015-02-02   37.059467
 2015-02-03   37.346756
 2015-02-04   37.562218
 2015-02-05   38.109848
 2015-02-06   38.073933
 2015-02-09   38.029053
 2015-02-10   38.244511
 2015-02-11   38.047009
 2015-02-12   38.684406
 2015-02-13   39.384666
 2015-02-17   39.402744
 2015-02-18   39.357540
 2015-02-19   39.330410
 2015-02-20   39.655910
 ...                ...
 2019-11-22  149.589996
 2019-11-25  151.229996
 2019-11-26  152.029999
 2019-11-27  152.320007
 2019-11-29  151.380005
 2019-12-02  149.550003
 2019-12-03  149.309998
 2019-12-04  149.850006
 2019-12-05  149.929993
 2019-12-06  151.750000
 2019-12-09  151.360001
 2019-12-10  151.130005
 2019-12-11  151.699997
 2019-12-12  153.240005
 2019-12-13  154.529999
 2019-12-16  155.529999
 2019-12-17  154.690002
 2019-12-18  154.369995
 2019-12-19  155.710007
 2019-12-20  157.410004
 2019-12-23  157.410004
 2019-12-24  157.380005
 2019-12-26  158.669998
 2019-12-27  158.960007
 2019-12-30  157.589996
 2019-12-31  157.699997
 2020-01-02  160.619995
 2020-01-03  158.619995
 2020-01-06  159.029999
 2020-01-07  157.580002

 [1258 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close     Volume  \
 Date
 2015-01-08   502.101471   489.655640   496.626526   501.303680  3353500.0
 2015-01-09   503.537537   493.435272   503.377991   494.811493  2071300.0
 2015-01-12   494.618011   486.225067   493.584869   491.201416  2326700.0
 2015-01-13   501.602844   491.041840   497.474182   494.821472  2370400.0
 2015-01-14   501.852173   491.650177   493.295654   499.498627  2235700.0
 2015-01-15   504.295471   496.397156   504.185760   500.416107  2715800.0
 2015-01-16   506.798584   498.631012   498.640991   506.688873  2298200.0
 2015-01-20   511.096771   504.630524   509.600891   505.512115  2232000.0
 2015-01-21   517.858215   504.814026   505.861145   516.621643  2268700.0
 2015-01-22   534.861511   518.277100   520.052185   532.926819  2676900.0
 2015-01-23   540.685547   531.540649   534.123535   538.471619  2281700.0
 2015-01-26   537.524231   528.219788   537.055542   533.744629  1543700.0
 2015-01-27   529.246948   516.771179   528.518921   517.210022  1904000.0
 2015-01-28   521.558044   508.603638   521.348633   508.603638  1683800.0
 2015-01-29   509.690643   499.827728   509.600891   509.261810  4186300.0
 2015-01-30   538.391846   514.108521   514.447571   533.056519  5606300.0
 2015-02-02   531.540649   517.130249   530.274109   527.033020  2849800.0
 2015-02-03   531.939575   521.827332   526.554321   527.790955  2038600.0
 2015-02-04   531.213562   519.842773   527.790955   521.328674  1663600.0
 2015-02-05   527.052979   520.660522   522.355896   526.135498  1849700.0
 2015-02-06   535.729126   524.968689   526.195312   529.546143  1763500.0
 2015-02-09   530.543396   524.579773   526.554321   526.384827  1267700.0
 2015-02-10   536.227783   525.477295   527.850769   535.469849  1749800.0

In [220]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-01-08  102.806480  127.657913   42.724323   501.303680
2015-01-09  102.916725  128.213913   42.365219   494.811493
2015-01-12  100.380791  126.062386   41.835537   491.201416
2015-01-13  101.272049  126.360535   41.620083   494.821472
2015-01-14  100.886154  125.546654   41.260979   499.498627
2015-01-15   98.148056  124.555489   40.830055   500.416107
2015-01-16   97.385445  126.626427   41.512352   506.688873
2015-01-20   99.893822  126.473312   41.647015   505.512115
2015-01-21  100.656441  122.557053   41.225071   516.621643
2015-01-22  103.275063  125.216255   42.311356   532.926819
2015-01-23  103.807991  125.603058   42.356243   538.471619
2015-01-26  103.918228  125.997902   42.203625   533.744629
2015-01-27  100.279716  123.830261   38.298370   517.210022
2015-01-28  105.948822  122.121933   36.978668   508.603638
2015-01-29  109.247391  125.288780   37.714828   509.261810
2015-01-30  107.648643  123.540154   36.269444   533.056519
2015-02-02  108.999298  124.628014   37.059467   527.033020
2015-02-03  109.017654  127.698143   37.346756   527.790955
2015-02-04  109.853806  126.481407   37.562218   521.328674
2015-02-05  110.637886  127.246925   38.109848   526.135498
2015-02-06  109.706200  127.173882   38.073933   529.546143
2015-02-09  110.434944  126.386787   38.029053   526.384827
2015-02-10  112.556557  128.667007   38.244511   535.469849
2015-02-11  115.194748  128.374893   38.047009   534.502502
2015-02-12  116.652199  128.634552   38.684406   541.443481
2015-02-13  117.224121  130.160095   39.384666   547.506836
2015-02-17  117.915962  130.614532   39.402744   541.353699
2015-02-18  118.736946  131.612671   39.357540   538.222290
2015-02-19  118.487869  132.992111   39.330410   541.383606
2015-02-20  119.456444  132.797379   39.655910   537.474365
...                ...         ...         ...          ...
2019-11-22  261.779999  134.339996  149.589996  1295.339966
2019-11-25  266.369995  135.970001  151.229996  1306.689941
2019-11-26  264.290009  135.089996  152.029999  1313.550049
2019-11-27  267.839996  133.770004  152.320007  1312.989990
2019-11-29  267.250000  134.449997  151.380005  1304.959961
2019-12-02  264.160004  132.910004  149.550003  1289.920044
2019-12-03  259.450012  132.119995  149.309998  1295.280029
2019-12-04  261.739990  131.990005  149.850006  1320.540039
2019-12-05  265.579987  131.910004  149.929993  1328.130005
2019-12-06  270.709991  133.220001  151.750000  1340.619995
2019-12-09  266.920013  133.919998  151.360001  1343.560059
2019-12-10  268.480011  133.910004  151.130005  1344.660034
2019-12-11  270.769989  133.759995  151.699997  1345.020020
2019-12-12  271.459991  135.320007  153.240005  1350.270020
2019-12-13  275.149994  134.210007  154.529999  1347.829956
2019-12-16  279.859985  134.130005  155.529999  1361.170044
2019-12-17  280.410004  134.220001  154.690002  1355.119995
2019-12-18  279.739990  134.410004  154.369995  1352.619995
2019-12-19  280.019989  134.559998  155.710007  1356.040039
2019-12-20  279.440002  135.589996  157.410004  1349.589966
2019-12-23  284.000000  135.550003  157.410004  1348.839966
2019-12-24  284.269989  134.979996  157.380005  1343.560059
2019-12-26  289.910004  134.910004  158.669998  1360.400024
2019-12-27  289.799988  135.270004  158.960007  1351.890015
2019-12-30  291.519989  132.809998  157.589996  1336.140015
2019-12-31  293.649994  134.039993  157.699997  1337.020020
2020-01-02  300.350006  135.419998  160.619995  1367.369995
2020-01-03  297.429993  134.339996  158.619995  1360.660034
2020-01-06  299.799988  134.100006  159.029999  1394.209961
2020-01-07  298.390015  134.190002  157.580002  1393.339966

[1258 rows x 4 columns]

In [221]:
volume

                   AAPL         IBM         MSFT       GOOG
Date
2015-01-08   59364500.0   4236800.0   29645200.0  3353500.0
2015-01-09   53699500.0   4488300.0   23944200.0  2071300.0
2015-01-12   49650800.0   4187600.0   23651900.0  2326700.0
2015-01-13   67091900.0   4377500.0   35270600.0  2370400.0
2015-01-14   48956600.0   4690300.0   29719600.0  2235700.0
2015-01-15   60014000.0   4248400.0   32750800.0  2715800.0
2015-01-16   78513300.0   5756000.0   35695300.0  2298200.0
2015-01-20   49899900.0   8392800.0   36161900.0  2232000.0
2015-01-21   48575900.0  11897100.0   39081100.0  2268700.0
2015-01-22   53796400.0   6120100.0   35898000.0  2676900.0
2015-01-23   46464800.0   4834800.0   26211600.0  2281700.0
2015-01-26   55615000.0   7888100.0   42525500.0  1543700.0
2015-01-27   95568700.0   5659600.0  169164000.0  1904000.0
2015-01-28  146477100.0   4495900.0   84507100.0  1683800.0
2015-01-29   84436400.0   8320800.0   63585300.0  4186300.0
2015-01-30   83745500.0   6563600.0   78004900.0  5606300.0
2015-02-02   62739100.0   4712200.0   50352500.0  2849800.0
2015-02-03   51915700.0   5539400.0   52082400.0  2038600.0
2015-02-04   70149700.0   3678500.0   41614800.0  1663600.0
2015-02-05   42246200.0   5253600.0   36548200.0  1849700.0
2015-02-06   43706600.0   3256500.0   34616600.0  1763500.0
2015-02-09   38889800.0   3057700.0   31381100.0  1267700.0
2015-02-10   62008500.0   4440600.0   29670700.0  1749800.0
2015-02-11   73561800.0   3626700.0   38262500.0  1377700.0
2015-02-12   74474500.0   3333100.0   33268800.0  1620200.0
2015-02-13   54272200.0   3706900.0   40264900.0  1900300.0
2015-02-17   63152400.0   2894500.0   33695700.0  1616800.0
2015-02-18   44891700.0   4358400.0   27111700.0  1453000.0
2015-02-19   37362400.0   3504400.0   27603400.0   989100.0
2015-02-20   48948400.0   3353000.0   29721100.0  1444300.0
...                 ...         ...          ...        ...
2019-11-22   16331300.0   3297500.0   15901800.0  1385700.0
2019-11-25   21005100.0   2590100.0   22420900.0  1036200.0
2019-11-26   26301900.0   3793200.0   24620100.0  1069700.0
2019-11-27   16308900.0   3280900.0   15184400.0   995600.0
2019-11-29   11654400.0   1825300.0   11977300.0   587000.0
2019-12-02   23621800.0   3067100.0   27418400.0  1510900.0
2019-12-03   28607600.0   3642500.0   24066000.0  1143800.0
2019-12-04   16795400.0   3530000.0   17574700.0  1537500.0
2019-12-05   18606100.0   3595400.0   17869100.0  1212700.0
2019-12-06   26518900.0   3437500.0   16403500.0  1314800.0
2019-12-09   32010600.0   2968500.0   16687400.0  1354300.0
2019-12-10   22605100.0   3480400.0   16476100.0  1094100.0
2019-12-11   19689200.0   3953300.0   18856600.0   850400.0
2019-12-12   34327600.0   4824100.0   24612100.0  1281000.0
2019-12-13   33396900.0   2535000.0   23845400.0  1549600.0
2019-12-16   32046500.0   3049200.0   24144200.0  1397300.0
2019-12-17   28539600.0   2907200.0   25425600.0  1854000.0
2019-12-18   29007100.0   3101800.0   24129200.0  1522600.0
2019-12-19   24592300.0   3866500.0   24958900.0  1469900.0
2019-12-20   68994500.0   7111800.0   53477500.0  3315000.0
2019-12-23   24643000.0   2803200.0   17718200.0   883100.0
2019-12-24   12119700.0   1202100.0    8989200.0   347500.0
2019-12-26   23280300.0   2129700.0   14520600.0   667500.0
2019-12-27   36566500.0   2752200.0   18412800.0  1038400.0
2019-12-30   36028600.0   4118900.0   16348400.0  1050900.0
2019-12-31   25201400.0   3777500.0   18369400.0   961800.0
2020-01-02   33870100.0   3148600.0   22622100.0  1406600.0
2020-01-03   36580700.0   2373700.0   21116200.0  1186400.0
2020-01-06   29596800.0   2425500.0   20813700.0  1732300.0
2020-01-07   27218000.0   3090800.0   21634100.0  1502700.0

[1258 rows x 4 columns]

In [222]:
returns = price.pct_change()

In [223]:
returns

                AAPL       IBM      MSFT      GOOG
Date
2015-01-08       NaN       NaN       NaN       NaN
2015-01-09  0.001072  0.004355 -0.008405 -0.012951
2015-01-12 -0.024641 -0.016781 -0.012503 -0.007296
2015-01-13  0.008879  0.002365 -0.005150  0.007370
2015-01-14 -0.003810 -0.006441 -0.008628  0.009452
2015-01-15 -0.027140 -0.007895 -0.010444  0.001837
2015-01-16 -0.007770  0.016627  0.016711  0.012535
2015-01-20  0.025757 -0.001209  0.003244 -0.002322
2015-01-21  0.007634 -0.030965 -0.010131  0.021977
2015-01-22  0.026015  0.021698  0.026350  0.031561
2015-01-23  0.005160  0.003089  0.001061  0.010404
2015-01-26  0.001062  0.003144 -0.003603 -0.008779
2015-01-27 -0.035013 -0.017204 -0.092534 -0.030978
2015-01-28  0.056533 -0.013796 -0.034458 -0.016640
2015-01-29  0.031134  0.025932  0.019908  0.001294
2015-01-30 -0.014634 -0.013957 -0.038324  0.046724
2015-02-02  0.012547  0.008806  0.021782 -0.011300
2015-02-03  0.000168  0.024634  0.007752  0.001438
2015-02-04  0.007670 -0.009528  0.005769 -0.012244
2015-02-05  0.007137  0.006052  0.014579  0.009220
2015-02-06 -0.008421 -0.000574 -0.000942  0.006482
2015-02-09  0.006643 -0.006189 -0.001179 -0.005970
2015-02-10  0.019211  0.018042  0.005666  0.017259
2015-02-11  0.023439 -0.002270 -0.005164 -0.001807
2015-02-12  0.012652  0.002023  0.016753  0.012986
2015-02-13  0.004903  0.011860  0.018102  0.011198
2015-02-17  0.005902  0.003491  0.000459 -0.011238
2015-02-18  0.006962  0.007642 -0.001147 -0.005784
2015-02-19 -0.002098  0.010481 -0.000689  0.005874
2015-02-20  0.008174 -0.001464  0.008276 -0.007221
...              ...       ...       ...       ...
2019-11-22 -0.000878  0.003736  0.000736 -0.004618
2019-11-25  0.017534  0.012133  0.010963  0.008762
2019-11-26 -0.007809 -0.006472  0.005290  0.005250
2019-11-27  0.013432 -0.009771  0.001908 -0.000426
2019-11-29 -0.002203  0.005083 -0.006171 -0.006116
2019-12-02 -0.011562 -0.011454 -0.012089 -0.011525
2019-12-03 -0.017830 -0.005944 -0.001605  0.004155
2019-12-04  0.008826 -0.000984  0.003617  0.019502
2019-12-05  0.014671 -0.000606  0.000534  0.005748
2019-12-06  0.019316  0.009931  0.012139  0.009404
2019-12-09 -0.014000  0.005254 -0.002570  0.002193
2019-12-10  0.005844 -0.000075 -0.001520  0.000819
2019-12-11  0.008529 -0.001120  0.003772  0.000268
2019-12-12  0.002548  0.011663  0.010152  0.003903
2019-12-13  0.013593 -0.008203  0.008418 -0.001807
2019-12-16  0.017118 -0.000596  0.006471  0.009897
2019-12-17  0.001965  0.000671 -0.005401 -0.004445
2019-12-18 -0.002389  0.001416 -0.002069 -0.001845
2019-12-19  0.001001  0.001116  0.008681  0.002528
2019-12-20 -0.002071  0.007655  0.010918 -0.004757
2019-12-23  0.016318 -0.000295  0.000000 -0.000556
2019-12-24  0.000951 -0.004205 -0.000191 -0.003914
2019-12-26  0.019840 -0.000519  0.008197  0.012534
2019-12-27 -0.000379  0.002668  0.001828 -0.006256
2019-12-30  0.005935 -0.018186 -0.008619 -0.011650
2019-12-31  0.007307  0.009261  0.000698  0.000659
2020-01-02  0.022816  0.010295  0.018516  0.022700
2020-01-03 -0.009722 -0.007975 -0.012452 -0.004907
2020-01-06  0.007968 -0.001786  0.002585  0.024657
2020-01-07 -0.004703  0.000671 -0.009118 -0.000624

[1258 rows x 4 columns]

In [224]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-12-31  0.007307  0.009261  0.000698  0.000659
2020-01-02  0.022816  0.010295  0.018516  0.022700
2020-01-03 -0.009722 -0.007975 -0.012452 -0.004907
2020-01-06  0.007968 -0.001786  0.002585  0.024657
2020-01-07 -0.004703  0.000671 -0.009118 -0.000624

In [225]:
returns['MSFT'].corr(returns['IBM'])

0.4837218908687079

In [226]:
returns['IBM'].corr(returns['MSFT'])

0.483721890868708

In [227]:
returns['IBM'].corr(returns['GOOG'])

0.4088961403859018

In [228]:
returns.MSFT.corr(returns.AAPL)

0.5726101233496661

In [229]:
returns.MSFT.cov(returns.AAPL)

0.00013102825759646604

In [230]:
returns.AAPL.cov(returns.GOOG)

0.0001233733050622297